MOD = 1_000_000_007

from modules.Matrix import Matrix

d = int(input())

mult = Matrix([
        # 학생회관 진리관 신양관 전산관 정보과학관 미래관 한경직기념관 형남공학관
    [0, 1, 0, 0, 0, 0, 0, 1], # 학생회관
    [1, 0, 1, 0, 0, 0, 1, 0], # 진리관
    [0, 1, 0, 1, 0, 1, 1, 0], # 신양관
    [0, 0, 1, 0, 1, 1, 0, 0], # 전산관
    [0, 0, 0, 1, 0, 1, 0, 0], # 정보과학관
    [0, 0, 1, 1, 1, 0, 1, 0], # 미래관
    [0, 1, 1, 0, 0, 1, 0, 1], # 한경직기념관
    [1, 0, 0, 0, 0, 0, 1, 0] # 형남공학관
], MOD)

initial = Matrix([[0, 0, 0, 0, 1, 0, 0, 0]], MOD)

print((initial * (mult ** d)).values[0][4])
